import { useCallback, type FC } from "react";

import cover from "@app/assets/pages/articles/zebraFinchesNatureDiet/cover.jpg";
import firstImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/1.jpg";
import secondImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/2.jpg";
import thirdImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/3.jpg";
import fourthImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/4.jpg";
import fiveImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/5.png";
import sixImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/6.png";
import sevenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/7.jpg";
import eightEightImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/88.jpg";
import eightImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/8.jpg";
import nineImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/9.jpg";
import tenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/10.jpg";
import elevenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/11.jpg";
import twelveImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/12.jpg";
import thirteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/13.jpg";
import fourteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/14.jpg";
import fifteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/15.jpg";
import sixteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/16.jpg";
import seventeenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/17.jpg";
import eighteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/18.jpg";
import nineteenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/19.png";
import twentyImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/20.jpg";
import twentyOneImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/21.jpg";
import twentyTwoImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/22.jpg";
import twentyThreeImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/23.jpg";
import twentyFourImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/24.jpg";
import twentyFiveImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/25.jpg";
import twentySixImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/26.jpg";
import twentySevenImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/27.jpg";
import twentyEightImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/28.jpg";
import twentyNineImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/29.jpg";
import thirtyImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/30.jpg";
import thirtyOneImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/31.jpg";
import thirtyTwoImage from "@app/assets/pages/articles/zebraFinchesNatureDiet/32.jpg";

import "./styles.scss";

const ZebraFinchesNatureDiet: FC = () => {
    return (
        <div className="article-content-wrapper">
            <div className="article-content">
                <h3 className="page-title">Питание зебровых амадин в природе</h3>
                <p>Статья написана на основе книги <i>«The Zebra Finch: A Synthesis of Field and Laboratory Studies»</i> (Richard A. Zann, 1996).</p>

                <blockquote>
                    <p><i>«Они проводят большую часть времени на земле и питаются семенами различных видов трав» - <b>Джон Гульд</b> о зебровых амадинах, 1865 г.</i></p>
                </blockquote>

                <p>Все австралийские амадины любят семена трав, но зебровые - настоящие эксперты в них.</p>

                <p>Исследования показывают: зебровые амадины почти не едят ни насекомых, ни другие виды семян. <i>Консерваторы...</i></p>

                <div className="set-of-pictures-container">
                    <div className="picture-container">
                        <img
                            src={firstImage}
                            className="picture"
                            style={{ height: "22rem", width: "auto" }}
                        />
                        <div className="picture-description">
                            Местные воробьи.
                            <a href="https://macaulaylibrary.org/asset/622388655"
                                target="_blank"
                                className="source-link"
                            >
                                Источник
                            </a>
                        </div>
                    </div>
                </div>

                <h3 id="study-design">1. Как изучали рацион амадин?</h3>

                <p>В книге упоминается 3 исследования:</p>

                <ul>
                    <li><i>Immelmann (1962, 1965)</i> просто наблюдал, чем питаются птицы и собирал образцы для определения. Этот метод плохо подходит для определения семян, которые уже опали, потому что на земле после нашествия птиц часто можно ничего не найти.</li>
                    <li><i>Davies (1977); Morton и Davies (1983)</i> – птиц отстреливали и изучали содержимое зоба. В этом случае точно определить вид семян (особенно родственных) может быть сложно, потому что они очищены от оболочки. И, конечно, это негуманный способ исследования.</li>
                    <li><i>Zann и Straw (1984)</i> – птиц ловили и отбирали содержимое зоба узкой трубочкой (оно поднималось вверх благодаря поглаживанию пальцем зоба).</li>
                </ul>

                <h3 id="crop-findings">2. Что амадины прятали в зобах?</h3>

                <p>Ответ прост: <b>семена трав</b>. И почти ничего больше.</p>

                <p>Всего в рационе выявлено <b>61 вид семян</b>, из них <b>58 — злаковые</b> (<i>9 из них были от интродуцированных видов - то есть завезенных в Австралию</i>).</p>

                <p>Семена были <b>в разном состоянии</b>: от мягких неспелых до старых и засохших.</p>

                <p>Амадины могут поедать семена разного размера:</p>

                <ul>
                    <li><b>Самые мелкие</b>: хлорис притуплённая, или австралийская пальчатая трава (<i>Chloris truncata</i>) - 1.5 × 0.4 мм, 0.2 мг.</li>

                    <li><b>Самые крупные</b>: ежовник обыкновенный (<i>Echinochloa crus-galli</i>) - 1.7 × 1.4 мм, 1.7 мг. <i>Ежовник обильно растет и у нас, так что летом идем собирать его для своих зебриков.</i></li>

                    <li>В неволе они могут есть еще более крупные семена <b>итальянского проса</b>, или <b>могара</b> (<i>Setaria italica</i>) - 1.9 x 1.1 мм; 2.0 мг. <i>Владельцы знают этот злак как компонент зерновой смеси, отдельно продается он и в колосьях.</i></li>

                    <li>Семена <b>спинифекса</b>, или <b>триодии</b> (<i>Triodia spp.</i>) были замечены в одном наблюдении, но не встречались в зобах амадин из мест с преобладанием этих трав. Возможно, они слишком длинные и проглатывать их неудобно.</li>

                    <blockquote>
                        <p>💡 <i><b>Триодия</b> - эндемик Австралии (то есть встречается только там). Аборигены готовили хлеб из её зёрен. Многие ее виды выделяют смолу, которая использовалась для создании оружия, а также сетей для ловли рыбы и птиц. - из Википедии</i></p>
                    </blockquote>

                    <li><b>Совсем большие зёрна</b> (<i>например, пшеница и овёс</i>), хотя и были доступны в их местах обитания, практически не употреблялись (только изредка находили их фрагменты).</li>
                </ul>

                <div className="set-of-pictures-container">
                    <div className="picture-container">
                        <img
                            src={secondImage}
                            className="picture"
                            style={{ height: "22rem", width: "auto" }}
                        />
                        <div className="picture-description">
                            Хлорис притуплённая.
                            <a href="https://en.wikipedia.org/wiki/Chloris_truncata" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                    <div className="picture-container">
                        <img
                            src={thirdImage}
                            className="picture"
                            style={{ height: "22rem", width: "auto" }}
                        />
                        <div className="picture-description">
                            Ежовник.
                            <a href="https://www.feedipedia.org/node/451" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                    <div className="picture-container">
                        <img
                            src={fourthImage}
                            className="picture"
                            style={{ height: "22rem", width: "auto" }}
                        />
                        <div className="picture-description">
                            Итальянское просо.
                            <a href="https://en.wikipedia.org/wiki/Foxtail_millet" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                    <div className="picture-container">
                        <img
                            src={fiveImage}
                            className="picture"
                            style={{ height: "22rem", width: "auto" }}
                        />
                        <div className="picture-description">
                            Триодия: общий вид, корни, листья и семена.
                            <a href="https://www.researchgate.net/figure/Triodia-sp-spinifex-utilised-in-the-experiments-and-the-groups-of-plant-parts-analysed_fig2_308004615" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                </div>
                <p>Семена двудольных (все злаки относятся к однодольным) нашли только у нескольких птиц.</p>

                <p>🥨 <i>Так что если ваши зебровые амадины не хотят есть ничего, кроме зерна - не расстраивайтесь сильно, они просто чтят традиции предков. (шутка)</i></p>

                <p>Для наглядности приведем карту Австралии, поскольку далее будут упоминаться географические названия.</p>

                <div className="picture-container">
                    <img
                        src={sixImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Австралия: штаты и климатические зоны.
                        <a href="https://ru.wikipedia.org/wiki/Файл:Australia-climate-map_ru.svg" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Зебровые амадины могут есть <b>насекомых</b>, но делают это <b>редко</b>:</p>

                <ul>
                    <li><i>North (1909)</i> отмечал, что они поедали термитов.</li>

                    <li><i>Zann и Straw (1984)</i> в северной части Виктории нашли насекомых <b>менее чем у 1% птиц</b> (из 540), а их доля в общем числе проглоченных объектов составляла <b>менее 1%</b> (17 645 предметов). <i>Какие пытливые умы это подсчитывали!</i></li>

                    <li><i>Morton и Davies (1983)</i> в восточной аридной (засушливой) зоне нашли <b>лишь двух насекомых</b> из представителей <i>Homoptera</i> <b>среди 34 221 объектов</b> в зобах 97 птиц.</li>

                    <blockquote>
                        <p><i><b>Homoptera</b> - равнокрылые насекомые, к ним относится тля. 🦗 (это эмодзи сверчка, но он тут похож на тлю)</i></p>
                    </blockquote>

                    <li><i>Davies (1977)</i> в западной Австралии почти не нашёл насекомых у 510 птиц.</li>
                    
                    <li><i>Immelmann (1962, 1970)</i> наблюдал амадин, ловящих термитов и летающих муравьёв <b>в воздухе</b> (птицы взлетали с насеста, ловили жертву и возвращались обратно, чтобы съесть). <i>Вот бы наши так мошек ловили из фруктов...</i></li>
                </ul>

                <p>Вот что нашли еще, кроме семян и насекомых:</p>

                <ul>
                    <li>🐚 Иногда в зобах находили <b>улиток и мелких ракообразных</b>, у которых есть раковины - вероятно, <b>в качестве источника минералов</b>, а не как источник пищи. <i>А в неволе мы даем ракушечник, сепию и скорлупу яиц.</i></li>

                    <li>🌿 <b>Зелёные части растений</b> (листья, кончики соцветий) чаще встречались в зобах <b>во время гнездования</b>.</li>

                    <li>🗻 <b>Мелкие камешки и песчинки</b> присутствовали регулярно. <i>В домашних условиях амадинам дают минеральную смесь для облегчения пищеварения.</i></li>
                </ul>

                <p>Самцы и самки зебровых амадин по результатам исследований питаются <b>одинаково</b>.</p>

                <h3 id="seasonal-changes">3. Зависит ли рацион зебровых амадин от времени года?</h3>

                <div className="picture-container">
                    <img
                        src={sevenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        В Австралии тоже есть ромашки...
                        <a href="https://macaulaylibrary.org/asset/622288797" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Исследования показали разные результаты в зависимости от региона:</p>

                <ul>
                    <li>В восточной аридной зоне <i>(Morton и Davies, 1983)</i> <b>существенных сезонных изменений в рационе не обнаружено</b>.</li>

                    <li>В северной Виктории <i>(Zann и Straw, 1984)</i> <b>рацион менялся трижды в течение года</b>, несмотря на то, что в целом употреблялось <b>12 видов семян</b>.</li>
                </ul>

                <p>На втором исследовании остановимся подробнее.</p>

                <p>Рацион зебровых амадин зависел от <b>сезонного созревания семян</b> (схема изображена ниже):</p>

                <div className="set-of-pictures-container">
                    <div className="picture-container">
                        <img
                            src={eightEightImage}
                            className="picture"
                        />
                        <div className="picture-description">
                            Мятлик.
                            <a href="https://ru.m.wikipedia.org/wiki/Файл:455_Poa_annua.jpg" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>

                    <div className="picture-container">
                        <img
                            src={eightImage}
                            className="picture"
                        />
                        <div className="picture-description">
                            Дантония дернистая (кочковатая).
                            <a href="https://www.nurseriesonline.com.au/plant-index/australian-native-plants/wallaby-grass/" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>

                    <div className="picture-container">
                        <img
                            src={nineImage}
                            className="picture"
                        />
                        <div className="picture-description">
                            Свинорой.
                            <a href="https://agroatlas.ru/ru/content/weeds/Cynodon_dactylon/index.html" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                </div>

                <ul>
                    <li><b>Зима (в Австралии это июнь–август)</b>: доминирует <b>ежовник</b> (<i>Echinochloa crus-galli</i>).</li>

                    <li><b>Начало весны (сентябрь)</b>: старые семена ежовника заканчиваются, птицы переключаются на <b>мелкие зелёные семена весенних однолетников - мятлика однолетнего</b> (<i>Poa annua</i>) <b>и свинороя пальчатого</b> (<i>Cynodon dactylon</i>).</li>

                    <li><b>Середина весны (октябрь–ноябрь)</b>: однолетние травы отцветают, амадины переходят на так называемые <b>травы валлаби</b> (народное название растений, которыми питаются кенгуру и валлаби). Сначала это <b>дантония дернистая</b> (<i>Danthonia caespitosa</i> на схеме, современное название - <i>Rytidosperma caespitosum</i>), затем - «южная болотная трава» (<i>Amphibromus neesi</i>).</li>

                    <li><b>Февраль</b>: начинается созревание нового урожая <b>ежовника</b>, и птицы возвращаются к нему.</li>
                </ul>

                <div className="picture-container">
                    <img
                        src={tenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Схема из книги, в какой период какие семена и в каком количестве могут найти птицы (семена обозначены точками). В верхней части показан график температур и осадков в течение года. Внизу буквами обозначены месяцы. Перевод подписей наш.
                    </div>
                </div>

                <p>На схеме видно, что пик плотности упавших семян ежовника приходится на июнь (начало зимы). Но мёртвые части растений прикрывают их, и амадины смогут добраться до семян только в июле.</p>

                <p>❄ <b>Конец зимы – начало весны</b> (август–сентябрь) — <b>самый сложный период</b> для птиц: запасы семян ежовника уже <b>закончились</b> или оказались <b>зарыты в грязь</b>, а весенние травы <b>ещё не начали давать семена</b>.</p>

                <p>Птицы дольше времени проводят на кормовых участках в поисках пищи и перемещаются на большие расстояния между ними. Их клювы и лбы становятся <b>грязными</b>, потому что семена приходится выкапывать...</p>

                <div className="picture-container">
                    <img
                        src={elevenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Археологические раскопки.
                        <a href="https://macaulaylibrary.org/asset/624850003" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <h3 id="seed-choice">4. Что влияет на выбор семян?</h3>

                <p>Несмотря на то, что зебровые амадины могут питаться семенами разных видов и размеров, их фактический рацион в природе <b>ограничивается небольшим числом видов трав</b>.</p>

                <p>Итак, что же влияет на выбор корма?</p>

                <p><b>a. Размер имеет значение</b></p>

                <p>Зебровые амадины предпочитают более крупные семена. Самым востребованным было семя <b>ежовника</b> – даже если оно было старым, птицы выбирали его вместо более мелких и свежих семян пальчатой травы <b>хлорис</b>. Эксперименты в лаборатории подтвердили, что птицы отдают предпочтение более увесистым семенам.</p>

                <div className="picture-container">
                    <img
                        src={twelveImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Оценивают, достойны ли семена в колоске быть съеденными.
                        <a href="https://macaulaylibrary.org/asset/631441949" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p><b>b. Сила привычки и выгода</b></p>

                <p>Домашние зебровые амадины, выращенные на одном виде семян, предпочитали его, даже если им был предоставлен выбор. <i>Владельцы знают, как тяжело приучить птиц к полезной пище, если в детстве им не подавали пример.</i></p>

                <p>Показано также, что взрослые амадины сначала отдают предпочтение знакомому типу корма, но если их вынуждали попробовать новые виды зерна, они выбирали те, что давали <b>наибольший энергетический выигрыш при минимальных затратах времени</b>. 📈</p>

                <p>В одном эксперименте птицам предлагали <b>четыре вида семян</b> в равном количестве и с одинаковой доступностью:</p>

                <ul>
                    <li><b>Белое просо</b> (White Millet, <i>Panicum miliaceum</i>)</li>
                    <li><b>Желтое просо</b> (Yellow Millet, <i>Setaria italica</i>)</li>
                    <li><b>Японское просо</b> (Japanese Millet, <i>Echinochloa crus-galli</i> - это культурная разновидность ежовника)</li>
                    <li><b>Канареечное семя</b> (Canary Seed, <i>Phalaris canariensis</i>)</li>
                </ul>

                <div className="picture-container">
                    <img
                        src={thirteenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        «Австралия, Австралия... Нас и здесь неплохо кормят».
                        <a href="https://www.flickr.com/photos/96539504@N04/19892981520/" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Выяснилось, что птицы выбирали семена <b>не только по размеру, но и по легкости обработки</b> (<i>Palmeros, 1983</i>):</p>

                <ul>
                    <li><b>Белое просо</b> оказалось предпочтительнее <b>желтого</b>, даже несмотря на более долгий процесс очистки. Его размер (3 × 2 мм против 2,5 × 1,5 мм) позволял съедать больше граммов в минуту, что сокращало общее время обеда.</li>

                    <li><b>Канареечное семя</b> было самым крупным, но из-за сложности очистки его старались избегать.</li>
                </ul>

                <p>Этот согласуется с общим принципом, который действует у многих животных: <i>максимизация скорости потребления пищи относительно затраченных усилий</i>.</p>

                <div className="picture-container">
                    <img
                        src={fourteenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Stonks. Картинка от нейросети
                    </div>
                </div>

                <p>🔹 Однако есть также исследования, в которых <b>не всегда</b> зебровые амадины выбирали самое энергетически выгодное зерно. <i>Morris (1955)</i> предлагал птицам <b>белое просо, желтое просо и канареечное семя</b> в течение двух недель, и вот что из этого получилось:</p>

                <ul>
                    <li><b>56-68% рациона</b> составляло <b>желтое просо</b>, несмотря на его меньший размер и сложность очистки.</li>

                    <li><b>21-41% – белое просо.</b></li>

                    <li><b>2-4% – канареечное семя.</b></li>
                </ul>

                <p>Возможно, разница в результатах объясняется тем, что в первом исследовании птиц тестировали всего три дня, перед этим лишая их еды на несколько часов. А во втором опыте зерно было в длительном свободном доступе.</p>

                <p><b>c. Степень спелости</b></p>

                <p><b>Птицы отдают предпочтение питательному корму</b>: они специально ищут <b>зеленые и созревающие семена</b> на колосьях, даже если рядом есть сухие семена на земле.</p>

                <p>Также выяснилось, что семена диких трав для них предпочтительнее покупного итальянского проса. Просо клали в кормушки, но птицы все равно летали искать дикие семена, и только иногда возвращались к кормушке для «дозаправки». Птенцов амадины также выкармливали дикими травами, даже если просо было рядом и в избытке.</p>

                <h3 id="seed-species">5. Основные виды семян в рационе</h3>

                <p>Исследования в разных регионах Австралии показали сильную зависимость от определённых видов трав:</p>

                <ul>
                    <li>В северной Виктории <b>66%</b> потребляемых семян приходилось на <b>ежовник</b>.</li>

                    <li>В Новом Южном Уэльсе <b>84%</b> семян принадлежали <b>девятиостнику</b> (<i>Enneapogon sp.</i>).</li>

                    <li>В Квинсленде <b>74%</b> семян принадлежали австралийскому <b>просу</b> (<i>Panicum decompositum</i>).</li>
                </ul>

                <div className="set-of-pictures-container">
                    <div className="picture-container">
                        <img
                            src={fifteenImage}
                            className="picture"
                        />
                        <div className="picture-description">
                            Девятиостник.
                            <a href="https://en.wikipedia.org/wiki/Enneapogon" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>

                    <div className="picture-container">
                        <img
                            src={sixteenImage}
                            className="picture"
                        />
                        <div className="picture-description">
                            Дикое просо - растение скромное.
                            <a href="https://www.inaturalist.org/taxa/369734-Panicum-decompositum" target="_blank" className="source-link">Источник</a>
                        </div>
                    </div>
                </div>

                <p>Таким образом, в каждом регионе зебровые амадины делают выбор в пользу <b>локально доминирующих видов трав</b>, даже если доступен широкий спектр семян.</p>

                <p>Для описания широты рациона в исследованиях использовали так называемый <b>индекс разнообразия диеты (B)</b>. Он варьировался <b>от 1.05 до 3.15</b>, что говорит о довольно узком рационе.</p>

                <div className="picture-container">
                    <img
                        src={seventeenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Зебровые амадины и их зеленые конкуренты.
                        <a href="https://www.natureinstock.com/search/preview/budgerigar-melopsittacus-undulatus-and-zebra-finch-taeniopygia-guttata/0_10107243.html" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Наибольшее разнообразие (B = 3.15) наблюдалось у популяции, где птицы были в плохом состоянии и питались семенами <b>семи различных видов</b>.</p>

                <p>🤔 <b>А как там у других видов?</b></p>

                <ul>
                    <li>В исследовании <i>Tidemann (1987)</i> в северной части Австралии зебровые амадины питались семенами 11 видов трав, в то время как Гульдовы амадины ели только 3 вида семян.</li>

                    <li><i>Morton и Davies (1983)</i> отметили, что разнообразие рациона амадин незначительно отличалось от такового у <b>волнистого попугайчика</b> (<i>Melopsittacus undulatus</i>) (он в меньшей степени поедает семена трав), но было у́же, чем у <b>острохохлого каменного голубя</b> (<i>Petrophassa plumifera</i>), который питается также семенами кустарников.</li>
                </ul>

                <div className="picture-container">
                    <img
                        src={eighteenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Острохохлый каменный, или белобрюхий султаноносный, голубь.
                        <a href="https://ru.wikipedia.org/wiki/%D0%91%D0%B5%D0%BB%D0%BE%D0%B1%D1%80%D1%8E%D1%85%D0%B8%D0%B9_%D1%81%D1%83%D0%BB%D1%82%D0%B0%D0%BD%D0%BE%D0%BD%D0%BE%D1%81%D0%BD%D1%8B%D0%B9_%D0%B3%D0%BE%D0%BB%D1%83%D0%B1%D1%8C" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Несколько исследований подтверждают, что <b>крупные зерноядные птицы</b> благодаря соответствующему размеру клюва могут позволить себе <b>более богатый рацион</b>. <i>Рисовки могут есть все, что зебрики, но не наоборот.</i></p>

                <p>В исследовании <i>Schopfer (1989)</i> у зебровых амадин был <b>самый бедный рацион</b> среди пяти видов амадин и астрильдов:</p>

                <div className="picture-container">
                    <img
                        src={nineteenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Виды птиц и их индексы разнообразия рациона (в порядке увеличения). Источники фото:
                        <a href="https://macaulaylibrary.org/asset/632084643" target="_blank" className="source-link">1</a>
                        <a href="https://macaulaylibrary.org/asset/632084643" target="_blank" className="source-link">2</a>
                        <a href="https://macaulaylibrary.org/asset/632084643" target="_blank" className="source-link">3</a>
                        <a href="https://macaulaylibrary.org/asset/632084643" target="_blank" className="source-link">4</a>
                        <a href="https://macaulaylibrary.org/asset/632084643" target="_blank" className="source-link">5</a>
                    </div>
                </div>

                <p>Однако особей зебровых амадин в этом регионе было мало, что могло исказить результаты.</p>

                <p>В отличие от других видов амадин, зебровые <b>не увеличивают потребление насекомых</b> даже в сезон размножения и не едят почти ничего, кроме семян.</p>

                <h3 id="why-seeds-only">6. Почему только семена трав?</h3>

                <p>Рацион зебровых амадин вызывает несколько интересных вопросов:</p>

                <p>a. Почему они почти исключительно питаются семенами трав?</p>

                <p>b. Почему они выбирают лишь несколько видов семян?</p>

                <p>c. Почему они практически не едят насекомых?</p>

                <p>В книге подробно разобран первый вопрос.</p>

                <p><b>1) Доступность в засушливых регионах</b></p>

                <p><b>Травы — наиболее распространенная растительность</b> в засушливых зонах, которая приспособлена к экстремальным условиям.</p>

                <div className="picture-container">
                    <img
                        src={twentyImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Типичный пейзаж, который видят зебровые амадины у себя на родине.
                        <a href="https://talkingplants.blogspot.com/2020/06/inland-spinifex-prickly-and-protective.html" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Хотя в этих местах осадки нерегулярны, семена трав остаются <b>надежным источником пищи</b>. Даже в неурожайные годы у амадин получается находить небольшие участки с растущими травами, у которых зреют семена. А в благоприятные сезоны травы буйно растут и дают массу семян, что приводит к активному размножению зебровых амадин.</p>

                <div className="picture-container">
                    <img
                        src={twentyOneImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Мама кормит птенца-слетка.
                        <a href="https://macaulaylibrary.org/asset/630194056" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Из-за непредсказуемости осадков амадины должны быть готовы мигрировать в поисках семян.</p>

                <p><b>2) Преимущества самих семян</b></p>

                <p>По сравнению с семенами других растений, <b>семена трав — это «удобная» пища</b> для амадин:</p>

                <ul>
                    <li>Оптимальный размер, не имеют жестких или липких оболочек и легко очищаются.</li>

                    <li>Не содержат токсичных веществ.</li>

                    <li>Созревают в больших количествах и могут храниться на поверхности почвы месяцами, формируя своеобразный <i>«банк семян»</i>.</li>

                    <li>Высокое содержание углеводов (80%) дает птицам не только энергию, но и метаболическую воду (она образуется от переработки углеводов), что особенно важно в засушливых зонах.</li>
                </ul>

                <h3 id="foraging">7. Методы добычи пищи (foraging - «фуражирование») зебровых амадин</h3>

                <p>Амадины едят в основном созревшие семена, упавшие на землю. Но также они могут собирать их прямо с колосьев, подпрыгивая и выклевывая семена по одному или садясь на ветки на уровне колосьев для удобства. Они даже могут <b>схватывать колос клювом (а иногда и лапкой!)</b>, притягивать его к земле и прижимать лапкой. Также наблюдали, как они подлетают к колоску, набирают в клюв несколько семян (3-4 штуки) и улетают на удобное место, чтобы очистить.</p>

                <div className="picture-container">
                    <img
                        src={twentyTwoImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Самец ест семена не отходя от кассы.
                        <a href="https://macaulaylibrary.org/asset/633155778" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p><b>Некоторые птицы</b> (не обязательно пары) проявляют командную работу - <b>по очереди пригибают колосья</b>, чтобы обе могли выклёвывать семена с земли.</p>

                <p>В то время, когда корм становится <b>в дефиците</b>, амадины <b>разгребают клювом почву движением в сторону</b>, ища <b>закопанные семена</b>. <i>В домашних условиях амадины такими же движениями сначала выбирают вкусные зернышки, а к концу дня ищут неочищенные под шелухой.</i></p>

                <div className="picture-container">
                    <img
                        src={twentyThreeImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Смотрит и ест.
                        <a href="https://macaulaylibrary.org/asset/624208681" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>📌 Как мы знаем, амадины шелушат зерно перед проглатываем. Процесс этот весьма не прост:</p>

                <ol>
                    <li>При захвате клювом семени <b>веки на мгновение закрываются</b>.</li>

                    <li><b>Язык фиксирует семя</b> на одной стороне клюва, на <b>треть его длины от кончика</b>.</li>

                    <li>Язык поворачивает семя так, чтобы обе половины его оболочки <b>прижались к краям верхней и нижней челюсти</b>.</li>

                    <li><b>Челюсти совершают синхронные вертикальные и боковые движения</b>, создавая <b>режущую силу</b>, которая <b>разрывает оболочку</b>.</li>

                    <li>Край верхней челюсти <b>проникает между частями оболочки и отделяет их от ядра</b>, которое птица проглатывает.</li>
                </ol>

                <p>Это общие принципы, но птицы <b>подстраивают</b> способ удержания семени в клюве и движения челюстей под размер и форму зерна.</p>

                <h3 id="crop-and-daily-needs">8. Зоб и суточная потребность в пище</h3>

                <p><b>Зоб</b> — это выпячивание пищевода с двумя долями, в котором накапливается пища перед основным этапом переваривания. Он хорошо заметен с обеих сторон шеи. В дикой природе у этих птиц наблюдается <b>суточный ритм</b> изменения наполнения зоба. Обычно объем зоба достигает максимума дважды в день: в позднее утро и перед ночевкой. <i>Подтверждаем: перед тем, как пойти на боковую, все сидят в кормушках.</i> В зимний период вечером наполненность выражена сильнее, чем летом.</p>

                <div className="picture-container">
                    <img
                        src={twentyFourImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        «Мешочек» на шее, наполненный кашей - зоб. Его хорошо видно у птенцов. Или у лысых птиц.
                        <a href="https://www.youtube.com/watch?v=sh3nS3Zb7pA" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>Если перед сном амадина наполняет зоб, к утру он будет уже пуст, а птица потеряет примерно 1 г массы. <i>Наблюдали это и у своих - взвешивали утром и вечером, когда лечили.</i></p>

                <p>Эксперименты с окрашенным зерном показали, что <b>от момента поедания до полного переваривания проходит 87–106 минут</b>, в зависимости от того, насколько заполнены зоб и желудок. <i>Это можно проверить на своих птицах, покормив их свеклой или зеленью.</i> 🥦</p>

                <p>В среднем, в зобе зебровой амадины содержится 100–300 мг зерна, а в желудке — 30–50 мг. В природе перед ночью зимой птицы могут запасать до 600–1000 мг зерна.</p>

                <p><b>В лабораторных условиях</b> домашние зебровые амадины потребляют около 3 г зерна в сутки, независимо от длины светового дня. По нашей сухой зерносмеси это около чайной ложки. При температуре 30–31°C потребление уменьшается до 1–2 г. Дикие птицы съедают 4 г в день, а если их лишить питьевой воды, то 3 г.</p>

                <blockquote>
                    <p>💡<i> <b>Интересный факт.</b> У зебровых амадин (по крайней мере домашних) усвояемость пищи немного улучшается в период размножения и линьки. Кроме того, она зависит от содержания в пище белка. Если его становится больше, то птицы эффективнее переваривают пищу. У рисовых и японских амадин такой зависимости не выявили.</i></p>

                    <p><i><b>Оценка усвояемости</b> основывается на сравнении <b>того, сколько птица съела</b> и <b>что вышло с пометом</b>. Измеряют энергетическую ценность того и другого и рассчитывают, <b>какой процент энергии организм действительно усвоил</b>, а не просто "пропустил через себя".</i></p>
                </blockquote>

                <div className="picture-container">
                    <img
                        src={twentyFiveImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Исследователи подсчитывают зернышки в зобах амадин
                    </div>
                </div>

                <p>В<b> естественных условиях</b> зебровым амадинам требуется больше корма из-за высокой физической активности, а также холода. В северной Виктории зимой им нужно примерно 5,3 г зерна в сутки (эквивалент 3 127 семян <b>ежовника</b>). Летом, когда пара птиц может насиживать кладку, самцу требуется 3,65 г (6 643 семени <b>болотной травы</b>), а самке — 3,84 г (7 000 семян).</p>

                <p>Лабораторные исследования показывают, что домашние зебровые амадины съедают 3 г семян <b>ежовника</b> (около 1 000 зерен) за 30–50 минут. Время на поиск корма сильно зависит от наличия мусора в корме:</p>

                <ul>
                    <li>шелухи нет - 33,5 минуты поиска,</li>
                    <li>зерно : шелуха 1:1 - 47,7 минут,</li>
                    <li>зерно : шелуха 1:2 - 69,4 минут,</li>
                    <li>зерно : шелуха 1:3 - 120 минут.</li>
                </ul>

                <p>⏳ Минимальное время, необходимое диким зебровым амадинам для добычи суточной нормы семян (5,3 г семян ежовника) зимой, составляет около <b>1,5 часов</b>, если предположить, что запасы семян в природе такие же обильные, как в лаборатории. Однако в природе поиск подходящего участка с кормом требует времени. Реальная продолжительность, вероятно, составляет <b>2-3 часа</b>.</p>

                <p>Летом поиск семян болотной травы занимает больше времени, так как они реже встречаются, сложнее очищаются от шелухи, и их требуется больше по количеству. В таких условиях общее время кормления увеличивается до 3-4 часов в день. <b>Сравните это с временем, которое тратят ваши домашние птицы. Одна из функций копошилок - растянуть время еды ее поиском.</b></p>

                <h3 id="feeding-area-choice">9. Выбор места для кормления</h3>

                <p>Наблюдения показали, что в северной части штата Виктория зебрики летали <b>до 1 км от гнезд</b> в поисках семян, а в центральной части материка они могли прилетать <b>за несколько километров</b> к клетке-ловушке с кормом.</p>

                <p>Участки, богатые семенами, распределены <b>неравномерно</b> - там, где влажность повышена, трава растет более густо. Если зебрики находят хороший источник пищи, они могут <b>долго проверять это место</b>, даже когда запасы уже исчерпаны. Поэтому ловушки, в которые кладут корм, могут стоять пустыми <b>месяцами</b>, но как только их пополняют, птицы быстро находят их снова.</p>

                <div className="picture-container">
                    <img
                        src={twentySixImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Хотели бы встретить этих милашек на улице?
                        <a href="https://macaulaylibrary.org/asset/112294971" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p><b>Поскольку зебровые амадины живут колониями</b>, то они могут быстрее находить пищу и передавать информацию о ней сородичам. Предполагается, что они могут учиться друг у друга, хотя специально этот аспект не изучали.</p>

                <p>В лабораторных условиях оказалось, что если одна птица в паре знает, где корм, а вторая – нет, то <b>неопытная просто эксплуатирует знания партнера, но не учится сама.</b> <i>Наш рисовый Пингвинчик ведет себе так же с Крабиком.</i></p>

                <p>Амадины стремятся выбирать участки, где плотность семян выше, а шелухи меньше (шелуха мешает искать целое зерно).</p>

                <h3 id="nestings-and-diet">10. Гнездование и рацион зебровых амадин</h3>

                <p>На графике ниже представлены пики размножения (количества гнезд). Они совпадают с <b>волнами вызревания семян</b> основных видов растений, которыми питаются птицы (мятлик, свинорой, травы валлаби, ежовник).</p>

                <div className="picture-container">
                    <img
                        src={twentySevenImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Всплески размножения (черные треугольники - количество гнезд) зависят от появления созревающих семян: <b>a</b> - Свинорой, <b>b</b> - Мятлик, <b>c</b> - Дантония, <b>d</b> - Амфибромус, <b>e</b> - Ежовник. Схема из книги
                    </div>
                </div>

                <p>Резкий всплеск размножения в апреле связан с тем, что растения (а именно ежовник, у которого самые большие, а значит энергетически выгодные семена) выросли во вторую волну из-за выпаса овец и снова дали семена.</p>

                <p>Хотя <b>разницы в потреблении семян между полами не обнаружено</b> в лабораторных исследованиях, в <b>период откладки яиц</b> было замечено, что <b>самки начали активно поедать источники кальция (например, сепию)</b>. <i>Кальций необходим для формирования скорлупы яиц.</i></p>

                <p>Птенцам требуется <b>все больше семян по мере роста</b>:</p>

                <table>
                    <thead>
                        <tr>
                            <th>Возраст, дни</th>
                            <th>Необходимо семян в день, г</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>5</td>
                            <td>0.74</td>
                        </tr>
                        <tr>
                            <td>10</td>
                            <td>1.83</td>
                        </tr>
                        <tr>
                            <td>14</td>
                            <td>2.70</td>
                        </tr>
                    </tbody>
                </table>

                <p>Если у пары <b>пять птенцов, готовящихся к вылету</b>, им нужно ежедневно приносить <b>13.5 г семян</b> плюс корм для себя.</p>

                <h3 id="feeding-in-flocks">11. Питание в стаях</h3>

                <div className="picture-container">
                    <img
                        src={twentyEightImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Что-то нашли...
                        <a href="https://macaulaylibrary.org/asset/631605931" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <ul>
                    <li><b>В период размножения</b> размеры стай становятся меньше, потому что родительские обязанности (высиживание яиц, кормление птенцов) ограничивают возможность объединяться. Средний размер стаи в пик (с ноября по январь) - <b>менее 10 птиц</b>, в остальные месяцы сезона - до 10-20 птиц.</li>

                    <li><b>После окончания периода размножения</b> происходит <b>резкое увеличение размера стай</b> — в среднем <b>от 150 до 350 птиц</b>.</li>
                    
                    <li>Небольшие стайки могут объединяться между собой.</li>

                    <li>Зимой, когда становится холоднее, стаи увеличиваются в размере.</li>

                    <li>Влияет и количество доступного корма: когда семена в изобилии, стаи становятся больше.</li>

                    <li>В сезон размножения <b>маленькие стаи</b> подпускают наблюдателя на <b>10 м</b> перед тем, как улететь, <b>крупные стаи</b> начинают улетать уже с <b>15–20 м</b>, а некоторые — даже с <b>40 м</b>. То есть в <b>большой стае выше бдительность</b>.</li>

                    <li><b>Во время кормления</b> зебровые амадины необычно <b>тихие</b> (хотя обычно это шумные птицы). Конечно - клюв-то занят!</li>

                    <li>Увидев кормящуюся стаю, птицы, летящие высоко, <b>резко меняют направление</b> и пикируют вниз.</li>

                    <li>Если семян <b>много</b>, то по земле птицы передвигаются <b>гладко и равномерно</b>, если <b>мало - резко и хаотично</b>, перепрыгивая впереди идущих птиц. Их движения выглядят, как катящаяся волна.</li>

                    <li><b>При опасности</b> вся стая мгновенно поднимается с <b>громким шумом</b> и улетает к ближайшему укрытию (дереву, забору). С первого взгляда это выглядит хаотично, но на самом деле стая движется организованно - пары и семьи держатся рядом. После того, как угроза миновала, птицы возвращаются на те же позиции.</li>
                </ul>

                <p><b>a. Смешанные кормовые стаи</b></p>

                <div className="picture-container">
                    <img
                        src={twentyNineImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Чернолицый артам (<i>Artamus cinereus</i>) среди зебровых амадин. Эти птицы питаются насекомыми и активно защищают свои гнезда от хищников, что дает выгоду амадинам по соседству.
                        <a href="https://macaulaylibrary.org/asset/629685698" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p>На водопоях и местах кормления зебровых амадин можно видеть в смешанных стаях с другими видами. Это может давать им преимущества в поиске корма и защите от хищников.</p>

                <p>Вот с кем их замечали:</p>

                <ul>
                    <li>С тростниковыми астрильдами (возможно, потому что у них тоже красный клюв - иногда стаи австралийских амадин собираются по этому признаку). <i>Общество без цветовой дифференциации <s>штанов</s> клювов лишено будущего...</i></li>

                    <li>С острохвостыми и масковыми амадинами.</li>

                    <li>С кольчатыми астрильдами.</li>

                    <li>С расписными астрильдами.</li>
                </ul>

                <div className="picture-container">
                    <img
                        src={thirtyImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Расписной астрильд и зебровые амадины.
                        <a href="https://ausemade.com.au/flora-fauna/fauna/birds/finches-fringillidae/painted-finch-emblema-pictum/painted-finch-mixed-company/" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <p><b>b. Стаи молодых особей</b></p>

                <p>Примерно через <b>неделю после вылета</b> молодые птицы иногда собираются в <b>чисто «детские» стаи</b>, но бывает это редко.</p>

                <p>Бывает, что птенцы из нескольких семей <b>сбиваются в «ясли»</b> в густых деревьях и ждут, пока родители их <b>не позовут на ужин</b>. Но в <b>большинстве случаев</b> семьи <b>держатся отдельно</b>.</p>

                <p>В возрасте <b>30–35 дней</b> молодые птицы обычно уже <b>летают достаточно хорошо</b>, чтобы присоединиться с родителями к взрослым стаям.</p>

                <div className="picture-container">
                    <img
                        src={thirtyOneImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        Юнцы.
                        <a href="https://macaulaylibrary.org/asset/631196968" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>

                <h3 id="conclusion">Выводы</h3>

                <ul>
                    <li>Зебровые амадины специализируются на семенах злаковых трав, они составляют <b>97-99%</b> рациона.</li>
                    
                    <li>В отличие от большинства других астрильдовых, они редко ловят насекомых, даже при выращивании птенцов.</li>

                    <li>Во время гнездования птицы поедают <b>немного зелени</b>.</li>

                    <li>Семена 61 вида трав употребляются в пищу, девять из них не являются местными. Сельскохозяйственные культуры птицы не трогают. <i>Рисовки, берите пример...</i></li>

                    <li>Разнообразие рациона довольно низкое, и птицы в большинстве районов специализируются на определенных видах семян.</li>

                    <li>Размер, знание семян ранее и время на очистку являются важными факторами при выборе типа семян, но также влияет содержание питательных веществ.</li>

                    <li>Большинство семян амадины собирают с земли, но полузрелые семена собирают с колосков.</li>

                    <li>В неволе суточная потребность на особь составляет около 3 г семян, тогда как в дикой природе требуется до 5,3 г.</li>

                    <li>Недозрелые семена трав являются важным компонентом рациона размножающихся птиц.</li>

                    <li>Вне сезона размножения могут формироваться кормящиеся стаи численностью до 350 особей, но в сезон размножения часто встречаются стаи из 10-20 особей.</li>
                    
                    <li>Смешанные виды кормящихся стай и стаи, состоящие только из молодняка, встречаются редко.</li>
                </ul>

                <div className="picture-container">
                    <img
                        src={thirtyTwoImage}
                        className="picture"
                    />
                    <div className="picture-description">
                        С кольчатым астрильдом на водопое.
                        <a href="https://macaulaylibrary.org/asset/620661588" target="_blank" className="source-link">Источник</a>
                    </div>
                </div>
            </div>

            {/* TODO: to separated component */}
            <div className="table-of-contents">
                <ul>
                    <li><AnchorToElement caption="Как изучали рацион амадин?" elementId="study-design" /></li>
                    <li><AnchorToElement caption="Что амадины прятали в зобах?" elementId="crop-findings" /></li>
                    <li><AnchorToElement caption="Зависит ли рацион зебровых амадин от времени года?" elementId="seasonal-changes" /></li>
                    <li><AnchorToElement caption="Что влияет на выбор семян?" elementId="seed-choice" /></li>
                    <li><AnchorToElement caption="Основные виды семян в рационе" elementId="seed-species" /></li>
                    <li><AnchorToElement caption="Почему только семена трав?" elementId="why-seeds-only" /></li>
                    <li><AnchorToElement caption="Методы добычи пищи (foraging - «фуражирование») зебровых амадин" elementId="foraging" /></li>
                    <li><AnchorToElement caption="Зоб и суточная потребность в пище" elementId="crop-and-daily-needs" /></li>
                    <li><AnchorToElement caption="Выбор места для кормления" elementId="feeding-area-choice" /></li>
                    <li><AnchorToElement caption="Гнездование и рацион зебровых амадин" elementId="nestings-and-diet" /></li>
                    <li><AnchorToElement caption="Питание в стаях" elementId="feeding-in-flocks" /></li>
                    <li><AnchorToElement caption="Выводы" elementId="conclusion" /></li>
                </ul>
            </div>
        </div>
    );
};

export default ZebraFinchesNatureDiet;

type AnchorToElementProps = {
    caption: string;

    elementId: string;

    className?: string;
};

const AnchorToElement: FC<AnchorToElementProps> = ({
    caption, elementId,
    className
}) => {
    const onClick = useCallback(() => {
        const element = document.getElementById(elementId);

        if (!element) {
            return;
        }

        element.scrollIntoView({
            behavior: "smooth",

        });
    }, [elementId]);

    return (
        <a
            onClick={onClick}
            className={className}
            style={{ cursor: "pointer" }}
        >
            {caption}
        </a>
    );
};
